{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[STOP]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[UNK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[SPACE]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "Whitespace"
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": "[UNK]",
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "byte_fallback": false,
        "vocab": {
            "[STOP]": 0,
            "[UNK]": 1,
            "[SPACE]": 2,
            "!": 3,
            ",": 4,
            ".": 5,
            "/": 6,
            "0": 7,
            "1": 8,
            "2": 9,
            "3": 10,
            "4": 11,
            "5": 12,
            "6": 13,
            "7": 14,
            "8": 15,
            "9": 16,
            ":": 17,
            "?": 18,
            "a": 19,
            "b": 20,
            "c": 21,
            "d": 22,
            "e": 23,
            "f": 24,
            "g": 25,
            "h": 26,
            "i": 27,
            "j": 28,
            "k": 29,
            "l": 30,
            "m": 31,
            "n": 32,
            "o": 33,
            "p": 34,
            "q": 35,
            "r": 36,
            "s": 37,
            "t": 38,
            "u": 39,
            "v": 40,
            "x": 41,
            "y": 42,
            "à": 43,
            "á": 44,
            "â": 45,
            "ã": 46,
            "è": 47,
            "é": 48,
            "ê": 49,
            "ì": 50,
            "í": 51,
            "ò": 52,
            "ó": 53,
            "ô": 54,
            "õ": 55,
            "ù": 56,
            "ú": 57,
            "ý": 58,
            "ă": 59,
            "đ": 60,
            "ĩ": 61,
            "ũ": 62,
            "ơ": 63,
            "ư": 64,
            "ạ": 65,
            "ả": 66,
            "ấ": 67,
            "ầ": 68,
            "ẩ": 69,
            "ẫ": 70,
            "ậ": 71,
            "ắ": 72,
            "ằ": 73,
            "ẳ": 74,
            "ặ": 75,
            "ẹ": 76,
            "ẻ": 77,
            "ẽ": 78,
            "ế": 79,
            "ề": 80,
            "ể": 81,
            "ễ": 82,
            "ệ": 83,
            "ỉ": 84,
            "ị": 85,
            "ọ": 86,
            "ỏ": 87,
            "ố": 88,
            "ồ": 89,
            "ổ": 90,
            "ỗ": 91,
            "ộ": 92,
            "ớ": 93,
            "ờ": 94,
            "ở": 95,
            "ỡ": 96,
            "ợ": 97,
            "ụ": 98,
            "ủ": 99,
            "ứ": 100,
            "ừ": 101,
            "ử": 102,
            "ữ": 103,
            "ự": 104,
            "ỳ": 105,
            "ỷ": 106,
            "ỹ": 107,
            "ng": 108,
            "nh": 109,
            "ch": 110,
            "th": 111,
            "là": 112,
            "tr": 113,
            "đư": 114,
            "ôi": 115,
            "kh": 116,
            "ông": 117,
            "ợc": 118,
            "được": 119,
            "ph": 120,
            "tôi": 121,
            "gi": 122,
            "có": 123,
            "và": 124,
            "đi": 125,
            "ườ": 126,
            "ên": 127,
            "đã": 128,
            "đâ": 129,
            "ười": 130,
            "ến": 131,
            "người": 132,
            "ất": 133,
            "không": 134,
            "đó": 135,
            "cô": 136,
            "ày": 137,
            "ấy": 138,
            "iệ": 139,
            "cá": 140,
            "họ": 141,
            "sẽ": 142,
            "ột": 143,
            "qu": 144,
            "một": 145,
            "đến": 146,
            "ết": 147,
            "ới": 148,
            "để": 149,
            "đồ": 150,
            "ần": 151,
            "củ": 152,
            "này": 153,
            "ại": 154,
            "ồi": 155,
            "làm": 156,
            "đây": 157,
            "của": 158,
            "nó": 159,
            "đá": 160,
            "độ": 161,
            "ta": 162,
            "chú": 163,
            "mà": 164,
            "anh": 165,
            "gì": 166,
            "rồi": 167,
            "ti": 168,
            "ươ": 169,
            "ậu": 170,
            "ều": 171,
            "thể": 172,
            "từ": 173,
            "đa": 174,
            "đồng": 175,
            "cậu": 176,
            "ướ": 177,
            "ầu": 178,
            "ương": 179,
            "đang": 180,
            "00": 181,
            "ình": 182,
            "ối": 183,
            "như": 184,
            "đâu": 185,
            "chúng": 186,
            "ành": 187,
            "ân": 188,
            "ải": 189,
            "ước": 190,
            "ai": 191,
            "ay": 192,
            "ra": 193,
            "tư": 194,
            "uy": 195,
            "đị": 196,
            "đầu": 197,
            "ơn": 198,
            "ức": 199,
            "nhà": 200,
            "giá": 201,
            "20": 202,
            "bá": 203,
            "co": 204,
            "mu": 205,
            "mẹ": 206,
            "nă": 207,
            "vì": 208,
            "về": 209,
            "với": 210,
            "ài": 211,
            "âu": 212,
            "ạn": 213,
            "ận": 214,
            "ật": 215,
            "ữa": 216,
            "ngh": 217,
            "phải": 218,
            "nhưng": 219,
            "ao": 220,
            "bạn": 221,
            "cả": 222,
            "cần": 223,
            "dự": 224,
            "ho": 225,
            "tí": 226,
            "úc": 227,
            "ăn": 228,
            "ội": 229,
            "nhất": 230,
            "thì": 231,
            "thành": 232,
            "giờ": 233,
            "điều": 234,
            "các": 235,
            "bị": 236,
            "iên": 237,
            "iết": 238,
            "lên": 239,
            "lại": 240,
            "nên": 241,
            "số": 242,
            "òn": 243,
            "ôn": 244,
            "ặt": 245,
            "ếu": 246,
            "ốn": 247,
            "ợng": 248,
            "chị": 249,
            "vào": 250,
            "điể": 251,
            "con": 252,
            "năm": 253,
            "an": 254,
            "bố": 255
        },
        "merges": [
            "n g",
            "n h",
            "c h",
            "t h",
            "l à",
            "t r",
            "đ ư",
            "ô i",
            "k h",
            "ô ng",
            "ợ c",
            "đư ợc",
            "p h",
            "t ôi",
            "g i",
            "c ó",
            "v à",
            "đ i",
            "ư ờ",
            "ê n",
            "đ ã",
            "đ â",
            "ườ i",
            "ế n",
            "ng ười",
            "ấ t",
            "kh ông",
            "đ ó",
            "c ô",
            "à y",
            "ấ y",
            "i ệ",
            "c á",
            "h ọ",
            "s ẽ",
            "ộ t",
            "q u",
            "m ột",
            "đ ến",
            "ế t",
            "ớ i",
            "đ ể",
            "đ ồ",
            "ầ n",
            "c ủ",
            "n ày",
            "ạ i",
            "ồ i",
            "là m",
            "đâ y",
            "củ a",
            "n ó",
            "đ á",
            "đ ộ",
            "t a",
            "ch ú",
            "m à",
            "a nh",
            "g ì",
            "r ồi",
            "t i",
            "ư ơ",
            "ậ u",
            "ề u",
            "th ể",
            "t ừ",
            "đ a",
            "đồ ng",
            "c ậu",
            "ư ớ",
            "ầ u",
            "ươ ng",
            "đa ng",
            "0 0",
            "ì nh",
            "ố i",
            "nh ư",
            "đâ u",
            "chú ng",
            "à nh",
            "â n",
            "ả i",
            "ướ c",
            "a i",
            "a y",
            "r a",
            "t ư",
            "u y",
            "đ ị",
            "đ ầu",
            "ơ n",
            "ứ c",
            "nh à",
            "gi á",
            "2 0",
            "b á",
            "c o",
            "m u",
            "m ẹ",
            "n ă",
            "v ì",
            "v ề",
            "v ới",
            "à i",
            "â u",
            "ạ n",
            "ậ n",
            "ậ t",
            "ữ a",
            "ng h",
            "ph ải",
            "như ng",
            "a o",
            "b ạn",
            "c ả",
            "c ần",
            "d ự",
            "h o",
            "t í",
            "ú c",
            "ă n",
            "ộ i",
            "nh ất",
            "th ì",
            "th ành",
            "gi ờ",
            "đi ều",
            "cá c",
            "b ị",
            "i ên",
            "i ết",
            "l ên",
            "l ại",
            "n ên",
            "s ố",
            "ò n",
            "ô n",
            "ặ t",
            "ế u",
            "ố n",
            "ợ ng",
            "ch ị",
            "và o",
            "đi ể",
            "co n",
            "nă m",
            "a n",
            "b ố"
        ],
        "language": "vi"
    }
}